# SketchId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wall..::..SketchId Property
Wall Class See Also
---
Returns id of the profile sketch, or invalidElementId if sketch does not exist.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ElementId SketchId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SketchId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
```

# Remarks
To create profile Sketch for the Wall, call CreateProfileSketch()()()().
# See Also
Wall Class
Autodesk.Revit.DB Namespace